ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f6636.h
//values of USBVECINT when USB-interrupt occured
#define     USBVECINT_NONE                     0x00
#define     USBVECINT_PWR_DROP                 0x02
#define     USBVECINT_PLL_LOCK                 0x04
#define     USBVECINT_PLL_SIGNAL               0x06
#define     USBVECINT_PLL_RANGE                0x08
#define     USBVECINT_PWR_VBUSOn               0x0A
#define     USBVECINT_PWR_VBUSOff              0x0C
#define     USBVECINT_USB_TIMESTAMP            0x10
#define     USBVECINT_INPUT_ENDPOINT0          0x12
#define     USBVECINT_OUTPUT_ENDPOINT0         0x14
#define     USBVECINT_RSTR                     0x16
#define     USBVECINT_SUSR                     0x18
#define     USBVECINT_RESR                     0x1A
#define     USBVECINT_SETUP_PACKET_RECEIVED    0x20
#define     USBVECINT_STPOW_PACKET_RECEIVED    0x22
#define     USBVECINT_INPUT_ENDPOINT1          0x24
#define     USBVECINT_INPUT_ENDPOINT2          0x26
#define     USBVECINT_INPUT_ENDPOINT3          0x28
#define     USBVECINT_INPUT_ENDPOINT4          0x2A
#define     USBVECINT_INPUT_ENDPOINT5          0x2C
#define     USBVECINT_INPUT_ENDPOINT6          0x2E
#define     USBVECINT_INPUT_ENDPOINT7          0x30
#define     USBVECINT_OUTPUT_ENDPOINT1         0x32
#define     USBVECINT_OUTPUT_ENDPOINT2         0x34
#define     USBVECINT_OUTPUT_ENDPOINT3         0x36
#define     USBVECINT_OUTPUT_ENDPOINT4         0x38
#define     USBVECINT_OUTPUT_ENDPOINT5         0x3A
#define     USBVECINT_OUTPUT_ENDPOINT6         0x3C
#define     USBVECINT_OUTPUT_ENDPOINT7         0x3E


/* ========================================================================= */
/* USB Operation Registers */
/* ========================================================================= */

#define USBIEPSIZXY_7_        0x23FF    /* Input Endpoint_7: X/Y-buffer size  */
sfrb(USBIEPSIZXY_7, USBIEPSIZXY_7_);
#define USBIEPBCTY_7_         0x23FE    /* Input Endpoint_7: Y-byte count  */
sfrb(USBIEPBCTY_7, USBIEPBCTY_7_);
#define USBIEPBBAY_7_         0x23FD    /* Input Endpoint_7: Y-buffer base addr.  */
sfrb(USBIEPBBAY_7, USBIEPBBAY_7_);
//sfrb    Spare       (0x23FC)   /* Not used  */
//sfrb    Spare       (0x23FB)   /* Not used  */
#define USBIEPBCTX_7_         0x23FA    /* Input Endpoint_7: X-byte count  */
sfrb(USBIEPBCTX_7, USBIEPBCTX_7_);
#define USBIEPBBAX_7_         0x23F9    /* Input Endpoint_7: X-buffer base addr. */
sfrb(USBIEPBBAX_7, USBIEPBBAX_7_);
#define USBIEPCNF_7_          0x23F8    /* Input Endpoint_7: Configuration  */
sfrb(USBIEPCNF_7, USBIEPCNF_7_);
#define USBIEPSIZXY_6_        0x23F7    /* Input Endpoint_6: X/Y-buffer size  */
sfrb(USBIEPSIZXY_6, USBIEPSIZXY_6_);
#define USBIEPBCTY_6_         0x23F6    /* Input Endpoint_6: Y-byte count */
sfrb(USBIEPBCTY_6, USBIEPBCTY_6_);
#define USBIEPBBAY_6_         0x23F5    /* Input Endpoint_6: Y-buffer base addr. */
sfrb(USBIEPBBAY_6, USBIEPBBAY_6_);
//sfrb    Spare       (0x23F4)   /* Not used  */
//sfrb    Spare       (0x23F3)   /* Not used  */
#define USBIEPBCTX_6_         0x23F2    /* Input Endpoint_6: X-byte count */
sfrb(USBIEPBCTX_6, USBIEPBCTX_6_);
#define USBIEPBBAX_6_         0x23F1    /* Input Endpoint_6: X-buffer base addr. */
sfrb(USBIEPBBAX_6, USBIEPBBAX_6_);
#define USBIEPCNF_6_          0x23F0    /* Input Endpoint_6: Configuration */
sfrb(USBIEPCNF_6, USBIEPCNF_6_);
#define USBIEPSIZXY_5_        0x23EF    /* Input Endpoint_5: X/Y-buffer size */
sfrb(USBIEPSIZXY_5, USBIEPSIZXY_5_);
#define USBIEPBCTY_5_         0x23EE    /* Input Endpoint_5: Y-byte count */
sfrb(USBIEPBCTY_5, USBIEPBCTY_5_);
#define USBIEPBBAY_5_         0x23ED    /* Input Endpoint_5: Y-buffer base addr. */
sfrb(USBIEPBBAY_5, USBIEPBBAY_5_);
//sfrb    Spare       (0x23EC)   /* Not used */
//sfrb    Spare       (0x23EB)   /* Not used */
#define USBIEPBCTX_5_         0x23EA    /* Input Endpoint_5: X-byte count */
sfrb(USBIEPBCTX_5, USBIEPBCTX_5_);
#define USBIEPBBAX_5_         0x23E9    /* Input Endpoint_5: X-buffer base addr. */
sfrb(USBIEPBBAX_5, USBIEPBBAX_5_);
#define USBIEPCNF_5_          0x23E8    /* Input Endpoint_5: Configuration */
sfrb(USBIEPCNF_5, USBIEPCNF_5_);
#define USBIEPSIZXY_4_        0x23E7    /* Input Endpoint_4: X/Y-buffer size */
sfrb(USBIEPSIZXY_4, USBIEPSIZXY_4_);
#define USBIEPBCTY_4_         0x23E6    /* Input Endpoint_4: Y-byte count */
sfrb(USBIEPBCTY_4, USBIEPBCTY_4_);
#define USBIEPBBAY_4_         0x23E5    /* Input Endpoint_4: Y-buffer base addr. */
sfrb(USBIEPBBAY_4, USBIEPBBAY_4_);
//sfrb    Spare       (0x23E4)   /* Not used */
//sfrb    Spare       (0x23E3)   /* Not used */
#define USBIEPBCTX_4_         0x23E2    /* Input Endpoint_4: X-byte count */
sfrb(USBIEPBCTX_4, USBIEPBCTX_4_);
#define USBIEPBBAX_4_         0x23E1    /* Input Endpoint_4: X-buffer base addr. */
sfrb(USBIEPBBAX_4, USBIEPBBAX_4_);
#define USBIEPCNF_4_          0x23E0    /* Input Endpoint_4: Configuration */
sfrb(USBIEPCNF_4, USBIEPCNF_4_);
#define USBIEPSIZXY_3_        0x23DF    /* Input Endpoint_3: X/Y-buffer size */
sfrb(USBIEPSIZXY_3, USBIEPSIZXY_3_);
#define USBIEPBCTY_3_         0x23DE    /* Input Endpoint_3: Y-byte count */
sfrb(USBIEPBCTY_3, USBIEPBCTY_3_);
#define USBIEPBBAY_3_         0x23DD    /* Input Endpoint_3: Y-buffer base addr. */
sfrb(USBIEPBBAY_3, USBIEPBBAY_3_);
//sfrb    Spare       (0x23DC)   /* Not used */
//sfrb    Spare       (0x23DB)   /* Not used */
#define USBIEPBCTX_3_         0x23DA    /* Input Endpoint_3: X-byte count */
sfrb(USBIEPBCTX_3, USBIEPBCTX_3_);
#define USBIEPBBAX_3_         0x23D9    /* Input Endpoint_3: X-buffer base addr. */
sfrb(USBIEPBBAX_3, USBIEPBBAX_3_);
#define USBIEPCNF_3_          0x23D8    /* Input Endpoint_3: Configuration */
sfrb(USBIEPCNF_3, USBIEPCNF_3_);
#define USBIEPSIZXY_2_        0x23D7    /* Input Endpoint_2: X/Y-buffer size */
sfrb(USBIEPSIZXY_2, USBIEPSIZXY_2_);
#define USBIEPBCTY_2_         0x23D6    /* Input Endpoint_2: Y-byte count */
sfrb(USBIEPBCTY_2, USBIEPBCTY_2_);
#define USBIEPBBAY_2_         0x23D5    /* Input Endpoint_2: Y-buffer base addr. */
sfrb(USBIEPBBAY_2, USBIEPBBAY_2_);
//sfrb    Spare       (0x23D4)   /* Not used */
//sfrb    Spare       (0x23D3)   /* Not used */
#define USBIEPBCTX_2_         0x23D2    /* Input Endpoint_2: X-byte count */
sfrb(USBIEPBCTX_2, USBIEPBCTX_2_);
#define USBIEPBBAX_2_         0x23D1    /* Input Endpoint_2: X-buffer base addr. */
sfrb(USBIEPBBAX_2, USBIEPBBAX_2_);
#define USBIEPCNF_2_          0x23D0    /* Input Endpoint_2: Configuration */
sfrb(USBIEPCNF_2, USBIEPCNF_2_);
#define USBIEPSIZXY_1_        0x23CF    /* Input Endpoint_1: X/Y-buffer size */
sfrb(USBIEPSIZXY_1, USBIEPSIZXY_1_);
#define USBIEPBCTY_1_         0x23CE    /* Input Endpoint_1: Y-byte count */
sfrb(USBIEPBCTY_1, USBIEPBCTY_1_);
#define USBIEPBBAY_1_         0x23CD    /* Input Endpoint_1: Y-buffer base addr. */
sfrb(USBIEPBBAY_1, USBIEPBBAY_1_);
//sfrb    Spare       (0x23CC)   /* Not used */
//sfrb    Spare       (0x23CB)   /* Not used */
#define USBIEPBCTX_1_         0x23CA    /* Input Endpoint_1: X-byte count */
sfrb(USBIEPBCTX_1, USBIEPBCTX_1_);
#define USBIEPBBAX_1_         0x23C9    /* Input Endpoint_1: X-buffer base addr. */
sfrb(USBIEPBBAX_1, USBIEPBBAX_1_);
#define USBIEPCNF_1_          0x23C8    /* Input Endpoint_1: Configuration */
sfrb(USBIEPCNF_1, USBIEPCNF_1_);
//sfrb       (0x23C7)   /* */
//sfrb     RESERVED         (0x1C00)    /* */
//sfrb       (0x23C0)   /* */
#define USBOEPSIZXY_7_        0x23BF    /* Output Endpoint_7: X/Y-buffer size */
sfrb(USBOEPSIZXY_7, USBOEPSIZXY_7_);
#define USBOEPBCTY_7_         0x23BE    /* Output Endpoint_7: Y-byte count */
sfrb(USBOEPBCTY_7, USBOEPBCTY_7_);
#define USBOEPBBAY_7_         0x23BD    /* Output Endpoint_7: Y-buffer base addr. */
sfrb(USBOEPBBAY_7, USBOEPBBAY_7_);
//sfrb    Spare       (0x23BC)   /* Not used */
//sfrb    Spare       (0x23BB)   /* Not used */
#define USBOEPBCTX_7_         0x23BA    /* Output Endpoint_7: X-byte count */
sfrb(USBOEPBCTX_7, USBOEPBCTX_7_);
#define USBOEPBBAX_7_         0x23B9    /* Output Endpoint_7: X-buffer base addr. */
sfrb(USBOEPBBAX_7, USBOEPBBAX_7_);
#define USBOEPCNF_7_          0x23B8    /* Output Endpoint_7: Configuration */
sfrb(USBOEPCNF_7, USBOEPCNF_7_);
#define USBOEPSIZXY_6_        0x23B7    /* Output Endpoint_6: X/Y-buffer size */
sfrb(USBOEPSIZXY_6, USBOEPSIZXY_6_);
#define USBOEPBCTY_6_         0x23B6    /* Output Endpoint_6: Y-byte count */
sfrb(USBOEPBCTY_6, USBOEPBCTY_6_);
#define USBOEPBBAY_6_         0x23B5    /* Output Endpoint_6: Y-buffer base addr. */
sfrb(USBOEPBBAY_6, USBOEPBBAY_6_);
//sfrb    Spare       (0x23B4)   /* Not used */
//sfrb    Spare       (0x23B3)   /* Not used */
#define USBOEPBCTX_6_         0x23B2    /* Output Endpoint_6: X-byte count */
sfrb(USBOEPBCTX_6, USBOEPBCTX_6_);
#define USBOEPBBAX_6_         0x23B1    /* Output Endpoint_6: X-buffer base addr. */
sfrb(USBOEPBBAX_6, USBOEPBBAX_6_);
#define USBOEPCNF_6_          0x23B0    /* Output Endpoint_6: Configuration */
sfrb(USBOEPCNF_6, USBOEPCNF_6_);
#define USBOEPSIZXY_5_        0x23AF    /* Output Endpoint_5: X/Y-buffer size */
sfrb(USBOEPSIZXY_5, USBOEPSIZXY_5_);
#define USBOEPBCTY_5_         0x23AE    /* Output Endpoint_5: Y-byte count */
sfrb(USBOEPBCTY_5, USBOEPBCTY_5_);
#define USBOEPBBAY_5_         0x23AD    /* Output Endpoint_5: Y-buffer base addr. */
sfrb(USBOEPBBAY_5, USBOEPBBAY_5_);
//sfrb    Spare       (0x23AC)   /* Not used */
//sfrb    Spare       (0x23AB)   /* Not used */
#define USBOEPBCTX_5_         0x23AA    /* Output Endpoint_5: X-byte count */
sfrb(USBOEPBCTX_5, USBOEPBCTX_5_);
#define USBOEPBBAX_5_         0x23A9    /* Output Endpoint_5: X-buffer base addr. */
sfrb(USBOEPBBAX_5, USBOEPBBAX_5_);
#define USBOEPCNF_5_          0x23A8    /* Output Endpoint_5: Configuration */
sfrb(USBOEPCNF_5, USBOEPCNF_5_);
#define USBOEPSIZXY_4_        0x23A7    /* Output Endpoint_4: X/Y-buffer size */
sfrb(USBOEPSIZXY_4, USBOEPSIZXY_4_);
#define USBOEPBCTY_4_         0x23A6    /* Output Endpoint_4: Y-byte count */
sfrb(USBOEPBCTY_4, USBOEPBCTY_4_);
#define USBOEPBBAY_4_         0x23A5    /* Output Endpoint_4: Y-buffer base addr. */
sfrb(USBOEPBBAY_4, USBOEPBBAY_4_);
//sfrb    Spare       (0x23A4)   /* Not used */
//sfrb    Spare       (0x23A3)   /* Not used */
#define USBOEPBCTX_4_         0x23A2    /* Output Endpoint_4: X-byte count */
sfrb(USBOEPBCTX_4, USBOEPBCTX_4_);
#define USBOEPBBAX_4_         0x23A1    /* Output Endpoint_4: X-buffer base addr. */
sfrb(USBOEPBBAX_4, USBOEPBBAX_4_);
#define USBOEPCNF_4_          0x23A0    /* Output Endpoint_4: Configuration */
sfrb(USBOEPCNF_4, USBOEPCNF_4_);
#define USBOEPSIZXY_3_        0x239F    /* Output Endpoint_3: X/Y-buffer size */
sfrb(USBOEPSIZXY_3, USBOEPSIZXY_3_);
#define USBOEPBCTY_3_         0x239E    /* Output Endpoint_3: Y-byte count */
sfrb(USBOEPBCTY_3, USBOEPBCTY_3_);
#define USBOEPBBAY_3_         0x239D    /* Output Endpoint_3: Y-buffer base addr. */
sfrb(USBOEPBBAY_3, USBOEPBBAY_3_);
//sfrb    Spare       (0x239C)   /* Not used */
//sfrb    Spare       (0x239B)   /* Not used */
#define USBOEPBCTX_3_         0x239A    /* Output Endpoint_3: X-byte count */
sfrb(USBOEPBCTX_3, USBOEPBCTX_3_);
#define USBOEPBBAX_3_         0x2399    /* Output Endpoint_3: X-buffer base addr. */
sfrb(USBOEPBBAX_3, USBOEPBBAX_3_);
#define USBOEPCNF_3_          0x2398    /* Output Endpoint_3: Configuration */
sfrb(USBOEPCNF_3, USBOEPCNF_3_);
#define USBOEPSIZXY_2_        0x2397    /* Output Endpoint_2: X/Y-buffer size */
sfrb(USBOEPSIZXY_2, USBOEPSIZXY_2_);
#define USBOEPBCTY_2_         0x2396    /* Output Endpoint_2: Y-byte count */
sfrb(USBOEPBCTY_2, USBOEPBCTY_2_);
#define USBOEPBBAY_2_         0x2395    /* Output Endpoint_2: Y-buffer base addr. */
sfrb(USBOEPBBAY_2, USBOEPBBAY_2_);
//sfrb    Spare       (0x2394)   /* Not used */
//sfrb    Spare       (0x2393)   /* Not used */
#define USBOEPBCTX_2_         0x2392    /* Output Endpoint_2: X-byte count */
sfrb(USBOEPBCTX_2, USBOEPBCTX_2_);
#define USBOEPBBAX_2_         0x2391    /* Output Endpoint_2: X-buffer base addr. */
sfrb(USBOEPBBAX_2, USBOEPBBAX_2_);
#define USBOEPCNF_2_          0x2390    /* Output Endpoint_2: Configuration */
sfrb(USBOEPCNF_2, USBOEPCNF_2_);
#define USBOEPSIZXY_1_        0x238F    /* Output Endpoint_1: X/Y-buffer size */
sfrb(USBOEPSIZXY_1, USBOEPSIZXY_1_);
#define USBOEPBCTY_1_         0x238E    /* Output Endpoint_1: Y-byte count */
sfrb(USBOEPBCTY_1, USBOEPBCTY_1_);
#define USBOEPBBAY_1_         0x238D    /* Output Endpoint_1: Y-buffer base addr. */
sfrb(USBOEPBBAY_1, USBOEPBBAY_1_);
//sfrb    Spare       (0x238C)   /* Not used */
//sfrb    Spare       (0x238B)   /* Not used */
#define USBOEPBCTX_1_         0x238A    /* Output Endpoint_1: X-byte count */
sfrb(USBOEPBCTX_1, USBOEPBCTX_1_);
#define USBOEPBBAX_1_         0x2389    /* Output Endpoint_1: X-buffer base addr. */
sfrb(USBOEPBBAX_1, USBOEPBBAX_1_);
#define USBOEPCNF_1_          0x2388    /* Output Endpoint_1: Configuration */
sfrb(USBOEPCNF_1, USBOEPCNF_1_);
#define USBSUBLK_             0x2380    /* Setup Packet Block */
sfrb(USBSUBLK, USBSUBLK_);
#define USBIEP0BUF_           0x2378    /* Input endpoint_0 buffer */
sfrb(USBIEP0BUF, USBIEP0BUF_);
#define USBOEP0BUF_           0x2370    /* Output endpoint_0 buffer */
sfrb(USBOEP0BUF, USBOEP0BUF_);
#define USBTOPBUFF_           0x236F    /* Top of buffer space */
sfrb(USBTOPBUFF, USBTOPBUFF_);
//         (1904 Bytes)               /* Buffer space */
#define USBSTABUFF_           0x1C00    /* Start of buffer space */
sfrb(USBSTABUFF, USBSTABUFF_);

/* USBIEPCNF_n Control Bits */
/* USBOEPCNF_n Control Bits */
//#define RESERVED       (0x0001)  /* USB -  */
//#define RESERVED       (0x0001)  /* USB -  */
#define DBUF           (0x0010)  /* USB - Double Buffer Enable */
//#define RESERVED       (0x0040)  /* USB -  */

/* USBIEPBCNT_n Control Bits */
/* USBOEPBCNT_n Control Bits */
#define CNT4           (0x0010)  /* USB - Byte Count Bit 3 */
#define CNT5           (0x0020)  /* USB - Byte Count Bit 3 */
#define CNT6           (0x0040)  /* USB - Byte Count Bit 3 */
/************************************************************
* UNIFIED CLOCK SYSTEM
************************************************************/
#define __MSP430_HAS_UCS__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_UCS__ 0x0160
#define UCS_BASE __MSP430_BASEADDRESS_UCS__

#define UCSCTL0_              0x0160    /* UCS Control Register 0 */
sfrb(UCSCTL0_L , UCSCTL0_);
sfrb(UCSCTL0_H , UCSCTL0_+1);
sfrw(UCSCTL0, UCSCTL0_);
#define UCSCTL1_              0x0162    /* UCS Control Register 1 */
sfrb(UCSCTL1_L , UCSCTL1_);
sfrb(UCSCTL1_H , UCSCTL1_+1);
sfrw(UCSCTL1, UCSCTL1_);
#define UCSCTL2_              0x0164    /* UCS Control Register 2 */
sfrb(UCSCTL2_L , UCSCTL2_);
sfrb(UCSCTL2_H , UCSCTL2_+1);
sfrw(UCSCTL2, UCSCTL2_);
#define UCSCTL3_              0x0166    /* UCS Control Register 3 */
sfrb(UCSCTL3_L , UCSCTL3_);
sfrb(UCSCTL3_H , UCSCTL3_+1);
sfrw(UCSCTL3, UCSCTL3_);
#define UCSCTL4_              0x0168    /* UCS Control Register 4 */
sfrb(UCSCTL4_L , UCSCTL4_);
sfrb(UCSCTL4_H , UCSCTL4_+1);
sfrw(UCSCTL4, UCSCTL4_);
#define UCSCTL5_              0x016A    /* UCS Control Register 5 */
sfrb(UCSCTL5_L , UCSCTL5_);
sfrb(UCSCTL5_H , UCSCTL5_+1);
sfrw(UCSCTL5, UCSCTL5_);
#define UCSCTL6_              0x016C    /* UCS Control Register 6 */
sfrb(UCSCTL6_L , UCSCTL6_);
sfrb(UCSCTL6_H , UCSCTL6_+1);
sfrw(UCSCTL6, UCSCTL6_);
#define UCSCTL7_              0x016E    /* UCS Control Register 7 */
sfrb(UCSCTL7_L , UCSCTL7_);
sfrb(UCSCTL7_H , UCSCTL7_+1);
sfrw(UCSCTL7, UCSCTL7_);
#define UCSCTL8_              0x0170    /* UCS Control Register 8 */
sfrb(UCSCTL8_L , UCSCTL8_);
sfrb(UCSCTL8_H , UCSCTL8_+1);
sfrw(UCSCTL8, UCSCTL8_);

/* UCSCTL0 Control Bits */
//#define RESERVED            (0x0001)    /* RESERVED */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
#define MOD0                (0x0008)    /* Modulation Bit Counter Bit : 0 */
#define MOD1                (0x0010)    /* Modulation Bit Counter Bit : 1 */
#define MOD2                (0x0020)    /* Modulation Bit Counter Bit : 2 */
#define MOD3                (0x0040)    /* Modulation Bit Counter Bit : 3 */
#define MOD4                (0x0080)    /* Modulation Bit Counter Bit : 4 */
#define DCO0                (0x0100)    /* DCO TAP Bit : 0 */
#define DCO1                (0x0200)    /* DCO TAP Bit : 1 */
#define DCO2                (0x0400)    /* DCO TAP Bit : 2 */
#define DCO3                (0x0800)    /* DCO TAP Bit : 3 */
#define DCO4                (0x1000)    /* DCO TAP Bit : 4 */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL0 Control Bits */
//#define RESERVED            (0x0001)    /* RESERVED */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
#define MOD0_L              (0x0008)    /* Modulation Bit Counter Bit : 0 */
#define MOD1_L              (0x0010)    /* Modulation Bit Counter Bit : 1 */
#define MOD2_L              (0x0020)    /* Modulation Bit Counter Bit : 2 */
#define MOD3_L              (0x0040)    /* Modulation Bit Counter Bit : 3 */
#define MOD4_L              (0x0080)    /* Modulation Bit Counter Bit : 4 */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL0 Control Bits */
//#define RESERVED            (0x0001)    /* RESERVED */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
#define DCO0_H              (0x0001)    /* DCO TAP Bit : 0 */
#define DCO1_H              (0x0002)    /* DCO TAP Bit : 1 */
#define DCO2_H              (0x0004)    /* DCO TAP Bit : 2 */
#define DCO3_H              (0x0008)    /* DCO TAP Bit : 3 */
#define DCO4_H              (0x0010)    /* DCO TAP Bit : 4 */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL1 Control Bits */
#define DISMOD              (0x0001)    /* Disable Modulation */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
//#define RESERVED            (0x0008)    /* RESERVED */
#define DCORSEL0            (0x0010)    /* DCO Freq. Range Select Bit : 0 */
#define DCORSEL1            (0x0020)    /* DCO Freq. Range Select Bit : 1 */
#define DCORSEL2            (0x0040)    /* DCO Freq. Range Select Bit : 2 */
//#define RESERVED            (0x0080)    /* RESERVED */
//#define RESERVED            (0x0100)    /* RESERVED */
//#define RESERVED            (0x0200)    /* RESERVED */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL1 Control Bits */
#define DISMOD_L            (0x0001)    /* Disable Modulation */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
//#define RESERVED            (0x0008)    /* RESERVED */
#define DCORSEL0_L          (0x0010)    /* DCO Freq. Range Select Bit : 0 */
#define DCORSEL1_L          (0x0020)    /* DCO Freq. Range Select Bit : 1 */
#define DCORSEL2_L          (0x0040)    /* DCO Freq. Range Select Bit : 2 */
//#define RESERVED            (0x0080)    /* RESERVED */
//#define RESERVED            (0x0100)    /* RESERVED */
//#define RESERVED            (0x0200)    /* RESERVED */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */


#define DCORSEL_0           (0x0000)    /* DCO RSEL 0 */
#define DCORSEL_1           (0x0010)    /* DCO RSEL 1 */
#define DCORSEL_2           (0x0020)    /* DCO RSEL 2 */
#define DCORSEL_3           (0x0030)    /* DCO RSEL 3 */
#define DCORSEL_4           (0x0040)    /* DCO RSEL 4 */
#define DCORSEL_5           (0x0050)    /* DCO RSEL 5 */
#define DCORSEL_6           (0x0060)    /* DCO RSEL 6 */
#define DCORSEL_7           (0x0070)    /* DCO RSEL 7 */


/* UCSCTL2 Control Bits */
#define FLLN0               (0x0001)    /* FLL Multipier Bit : 0 */
#define FLLN1               (0x0002)    /* FLL Multipier Bit : 1 */
#define FLLN2               (0x0004)    /* FLL Multipier Bit : 2 */
#define FLLN3               (0x0008)    /* FLL Multipier Bit : 3 */
#define FLLN4               (0x0010)    /* FLL Multipier Bit : 4 */
#define FLLN5               (0x0020)    /* FLL Multipier Bit : 5 */
#define FLLN6               (0x0040)    /* FLL Multipier Bit : 6 */
#define FLLN7               (0x0080)    /* FLL Multipier Bit : 7 */
#define FLLN8               (0x0100)    /* FLL Multipier Bit : 8 */
#define FLLN9               (0x0200)    /* FLL Multipier Bit : 9 */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
#define FLLD0               (0x1000)    /* Loop Divider Bit : 0 */
#define FLLD1               (0x2000)    /* Loop Divider Bit : 1 */
#define FLLD2               (0x4000)    /* Loop Divider Bit : 1 */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL2 Control Bits */
#define FLLN0_L             (0x0001)    /* FLL Multipier Bit : 0 */
#define FLLN1_L             (0x0002)    /* FLL Multipier Bit : 1 */
#define FLLN2_L             (0x0004)    /* FLL Multipier Bit : 2 */
#define FLLN3_L             (0x0008)    /* FLL Multipier Bit : 3 */
#define FLLN4_L             (0x0010)    /* FLL Multipier Bit : 4 */
#define FLLN5_L             (0x0020)    /* FLL Multipier Bit : 5 */
#define FLLN6_L             (0x0040)    /* FLL Multipier Bit : 6 */
#define FLLN7_L             (0x0080)    /* FLL Multipier Bit : 7 */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL2 Control Bits */
#define FLLN8_H             (0x0001)    /* FLL Multipier Bit : 8 */
#define FLLN9_H             (0x0002)    /* FLL Multipier Bit : 9 */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
#define FLLD0_H             (0x0010)    /* Loop Divider Bit : 0 */
#define FLLD1_H             (0x0020)    /* Loop Divider Bit : 1 */
#define FLLD2_H             (0x0040)    /* Loop Divider Bit : 1 */
//#define RESERVED            (0x8000)    /* RESERVED */

